In [47]:
# Plantilla de Pre Procesado - Datos faltantes

# Cómo importar las librerías
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [52]:
# Importar el data set
dataset = pd.read_csv('Data.csv')
X = dataset.iloc[:, :-1]
y = dataset.iloc[:, 3]
X

   Country   Age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0
3    Spain  38.0  61000.0
4  Germany  40.0      NaN
5   France  35.0  58000.0
6    Spain   NaN  52000.0
7   France  48.0  79000.0
8  Germany  50.0  83000.0
9   France  37.0  67000.0

In [42]:
# Conteo de los NAs de una columna
X["Age"].isnull().sum()

1

In [41]:
# Conteo de los NAs de todo el dataframe
X.isnull().sum()

Country    0
Age        1
Salary     1
dtype: int64

In [33]:
# Tratamiento de los NA por columna
X.Age = X["Age"].fillna(X.Age.mean())  # Imputando con la media
X.Salary = X["Salary"].fillna(X.Salary.mean())

"""
# Si los desea borrar
# X.dropna(axis=0, how="all")  Borra si tiene todas las columnas NaN
# X.dropna(axis=0, how="any") Borra si tiene alguna columna NaN

# X.dropna(subset=["Salary"]) Borra todas las filas que tienen NaN en Salary
"""

In [46]:
# Tratamiento de los NA para todo el Dataframe
X.fillna(0)  # se puede usar el argumento method="bfill" o "ffill"

   Country   Age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0
3    Spain  38.0  61000.0
4  Germany  40.0      0.0
5   France  35.0  58000.0
6    Spain   0.0  52000.0
7   France  48.0  79000.0
8  Germany  50.0  83000.0
9   France  37.0  67000.0